DROP TABLE Excursion;

CREATE TABLE `Excursion` (
  `id` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(50) NOT NULL,
  `Description` varchar(255) NOT NULL,
  `IsWithGuide` tinyint(1) NOT NULL DEFAULT '0',
  `Price` float NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

INSERT INTO Excursion VALUES("2","Військові спогади","Екскурсія познайомить вас з історією та героями українського війська в різні періоди часу","0","100");
INSERT INTO Excursion VALUES("3","Українські культури ","Екскурсія дозволить вам побачити різноманітність та багатство українських культур","1","300");
INSERT INTO Excursion VALUES("5","Наукові дослідження","Екскурсія демонструє, як українські науковці та винахідники сприяли розвитку науки та технологій у світі","1","200");



DROP TABLE ExcursionInfo;

CREATE TABLE `ExcursionInfo` (
  `id_excursion` int DEFAULT NULL,
  `CountEntries` int DEFAULT '0',
  KEY `excursioninfo_ibfk_1` (`id_excursion`),
  CONSTRAINT `excursioninfo_ibfk_1` FOREIGN KEY (`id_excursion`) REFERENCES `Excursion` (`id`) ON DELETE SET NULL ON UPDATE SET NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

INSERT INTO ExcursionInfo VALUES("2","7");
INSERT INTO ExcursionInfo VALUES("3","3");
INSERT INTO ExcursionInfo VALUES("5","3");
INSERT INTO ExcursionInfo VALUES("","0");
INSERT INTO ExcursionInfo VALUES("","0");



DROP TABLE Exponat;

CREATE TABLE `Exponat` (
  `id` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(50) NOT NULL,
  `Description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `Price` float NOT NULL,
  `Count` int NOT NULL DEFAULT '1',
  `Photo` varchar(20) DEFAULT NULL,
  `id_viewplace` int DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `id_viewplace` (`id_viewplace`),
  CONSTRAINT `exponat_ibfk_2` FOREIGN KEY (`id_viewplace`) REFERENCES `ViewPlace` (`id`) ON DELETE SET NULL
) ENGINE=InnoDB AUTO_INCREMENT=30 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

INSERT INTO Exponat VALUES("1","Козацька шабля","Козацька шабля - це вид холодної зброї, яка має однолезний, одноручний і безгардовий клинок. Вона є різновидом шашки - традиційної зброї кавказьких народів. Козацька шабля була символом козацтва і їхнього воїнського духу","600","1","64899dc2d74fe.jpg","1");
INSERT INTO Exponat VALUES("2","Літопис Самовидця","Літопис Самовидця - це анонімний історичний твір, який описує події в Україні з 1648 по 1702 роки. Автор був очевидцем багатьох з них і мав доступ до документів і свідчень. Літопис Самовидця належить до жанру козацьких літописів, які виникли в другій половині XVII - XVIII століттях","350","1","64899bcb1cdca.jpg","1");
INSERT INTO Exponat VALUES("3","Test","TestDescription","100","3","64898d2b97ad5.jpg","");
INSERT INTO Exponat VALUES("4","Name10","wer","10","2","648995a17da2e.jpg","");
INSERT INTO Exponat VALUES("5","Name2","kjhfkjhgk","1","10","64899684f15ab.jpg","");
INSERT INTO Exponat VALUES("7","Герб війська Запорізького","Герб війська Запорізького - це офіційний символ Запорізької Січі - козацької держави, що існувала на території України з XVI по XVIII століття.Герб був затверджений у 1648 році гетьманом Богданом Хмельницьким під час національно-визвольної війни проти Речі Посполитої. Герб використовувався як державний символ Запорізької Січі до її ліквідації російською імператоршею Катериною II у 1775 році","1200","1","648b3c8088e65.jpg","1");
INSERT INTO Exponat VALUES("8","Козацький пістоль","Козацький пістоль - це вогнепальна зброя, яку використовували козаки з XVI по XVIII століття. Пістоль був одним з основних видів зброї козацької кавалерії, яка славилася своєю швидкістю та маневреністю. Пістоль мав дерев’яну рукоятку та металевий ствол з кремневим запалом. Пістоль стріляв кулями або дробом, які заряджалися через ствол разом з порохом та ватою. Пістоль мав досить короткий дальнобійність та низьку точність, тому використовувався переважно на близькій дистанції","2000","1","648b3d2cd1187.jpg","1");
INSERT INTO Exponat VALUES("9","Козацька шапка","Козацька шапка - це головний убір, який носили козаки з XVI по XVIII століття. Шапка була зроблена з вовняної тканини або шкіри та мала високий конусоподібний або циліндричний купол. Шапка могла мати різні кольори та оздоблення, такі як хутра, пера, стрічки, монети тощо. Шапка слугувала не тільки захистом від холоду та сонця, але й елементом козацької ідентичності та гордості. Шапка також могла вказувати на соціальний статус або військове звання козака. Наприклад, чорна шапка з червоною стрічкою була привілеєм гетьмана - головного козацького ватажка.","500","1","648b3f96281e1.jpg","1");
INSERT INTO Exponat VALUES("10","Козацька печатка","Козацька печатка - це металевий штамп, який використовувався козаками для засвідчення своїх документів. Печатка мала круглу або овальну форму та містила зображення та написи, які характеризували козацьку спільноту або особистість. Печатка могла належати окремому козакові, родині, сотні, полку, війську або гетьманові. Печатка слугувала не тільки засобом легалізації документів, але й елементом козацької самосвідомості та гідності","1100","1","648b404dc5ad2.jpg","1");
INSERT INTO Exponat VALUES("12","Герб Українських Січових Стрільців","Цей герб був розроблений пресовою квартирою Українських Січових Стрільців у 1915-1916 роках як символ соборної України. Він складається з тризуба — давнього знака князів Русі-України, який оточений вінком з листя дуба — символу сили і мужності, і пшениці — символу достатку і плодючості. Над тризубом розташована корона — ознака державності і незалежності. Герб Українських Січових Стрільців виражав єдність українського народу на всіх його землях і його боротьбу за свободу і справедливість","1300","1","648b4285b1ba6.jpg","2");
INSERT INTO Exponat VALUES("13","Фото Дмитра Вітовського","Це фото Дмитра Вітовського (1887-1919) — українського політика і військового лідера, який був державним секретарем військових справ ЗУНР і начальним командантом Української Галицької Армії. Вітовський брав участь у створенні Легіону Українських Січових Стрільців і Листопадового чину 1918 року. Він також був одним з ініціаторів Злуки УНР і ЗУНР у 1919 році. Вітовський загинув у авіакатастрофі поблизу Ратибора в Польщі","400","1","648b439aa6baa.jpg","2");
INSERT INTO Exponat VALUES("14","Мосін","Це Мосін —  гвинтівка з ковзним затвором, яка була розроблена у 1891 році капітаном Сергієм Мосіним і бельгійським конструктором Леоном Наганом. Вона стріляла патронами калібру 7,62×54 мм Р. Вона була основною зброєю піхоти  СРСР під час Першої світової війни","1400","1","648b4462e6786.jpg","2");
INSERT INTO Exponat VALUES("15","Пістолет C96","Це німецький самозарядний пістолет, який був розроблений у 1895 році і випускався до 1938 року. Він мав високу мощність і дальнобійність для пістолета, а також можливість використання кобури-приклада для поліпшення точності стрільби. Він стріляв патронами калібру 7,63×25 мм Маузер або 9 мм Парабеллум. Він був на озброєнні німецької армії та інших країн під час Першої світової війни і брав участь у багатьох конфліктах","2180","1","648b44fd4526b.jpg","2");
INSERT INTO Exponat VALUES("16","Трипільский кухлик","Цей кухлик є зразком кераміки Трипільської культури, яка існувала на території сучасної України, Румунії та Молдови в період неоліту та раннього енеоліту (7000−2750 рр. до н. е.). Трипільська культура була однією з найбільш розвинених і загадкових давньоземлеробських культур Європи, яка створювала величезні поселення, храми, фігурки та мальовану кераміку","2300","1","648c6b02d9a29.jpg","11");
INSERT INTO Exponat VALUES("17","Горщик","Цей горщик є зразком кераміки Трипільської культури, яка існувала на території сучасної України, Румунії та Молдови в період неоліту та раннього енеоліту (7000−2750 рр. до н. е.). Трипільська культура була однією з найбільш розвинених і загадкових давньоземлеробських культур Європи, яка створювала величезні поселення, храми, фігурки та мальовану кераміку","3000","1","648c6bca87095.jpg","11");
INSERT INTO Exponat VALUES("18","Статуетка","Ця статуетка є зразком кераміки Трипільської культури, яка існувала на території сучасної України, Румунії та Молдови в період неоліту та раннього енеоліту (7000−2750 рр. до н. е.). Трипільська культура була однією з найбільш розвинених і загадкових давньоземлеробських культур Європи, яка створювала величезні поселення, храми, фігурки та мальовану кераміку","1000","1","648c6c409e519.jpg","11");
INSERT INTO Exponat VALUES("19","Уламки кераміки","Це уламки кераміки Трипільської культури, яка існувала на території сучасної України, Румунії та Молдови в період неоліту та раннього енеоліту (7000−2750 рр. до н. е.). Трипільська культура була однією з найбільш розвинених і загадкових давньоземлеробських культур Європи, яка створювала величезні поселення, храми, фігурки та мальовану кераміку","900","8","648c6cb095af2.jpg","11");
INSERT INTO Exponat VALUES("20","Квіти ","Ця картина належить до творчості Катерини Білокур, видатної української художниці-самоук, яка прославилася своїми неперевершеними зображеннями квітів. Картина була написана в 1935 році і входить до золотого фонду українського мистецтва","2700","1","648c73d738835.jpg","15");
INSERT INTO Exponat VALUES("21","Хліб","Ця картина є твором Тетяни Яблонської, видатної української художниці, яка прославилася своїми зображеннями сільського життя і праці. Картина була написана в 1949 році і отримала Сталінську премію II ступеня в 1950 році","3500","1","648c733fd92ca.jpg","15");
INSERT INTO Exponat VALUES("22","Картина \"Козаки пишуть листа турецькому султану\"","Ця картина є твором Іллі Рєпіна, видатного українського художника, який зображав історичні та національні сюжети. Картина була написана в 1891 році і є однією з найвідоміших робіт автора","5000","1","648c778149bc5.jpg","1");
INSERT INTO Exponat VALUES("23","Козаки пишуть листа турецькому султану","Ця картина є твором Іллі Рєпіна, видатного українського художника, який зображав історичні та національні сюжети. Картина була написана в 1891 році і є однією з найвідоміших робіт автора","5000","1","648c77a054719.jpg","15");
INSERT INTO Exponat VALUES("24","Козак Мамай","Ця картина є твором Алли Горської, української художниці, дисидентки і авангардистки. Вона зображує Козака Мамая, символічного персонажа української культури, який втілює ідею свободи, сили і героїзму","3200","1","648c7e77c286e.jpg","15");
INSERT INTO Exponat VALUES("25","Шолом","Цей шолом є зразком СШ-68, радянського сталевого шолома зразка 1968 року. Він був призначений для захисту голови від скалок і дрібнокаліберних куль. Він мав овальну форму з низьким козирком і наборідником. Він мав вагу близько 1,3 кг і був пофарбований у зелений колір. Він мав підвіску з шести полотняних стрічок і підборідний ремінець","500","1","648d4ba949c2e.jpg","3");
INSERT INTO Exponat VALUES("26","Кулемет \"Максим\"","Цей кулемет є зразком станкового кулемета, який був розроблений британським зброярем американського походження Гайрем Стівенсом Максимом у 1883 році. Він був першим кулеметом, який використовував енергію віддачі ствола для автоматичного перезаряджання. Він мав вагу близько 20 кг і стріляв патронами калібру 7,62 мм з металевої або полотняної стрічки на 250 набоїв. Він мав темп вогню близько 600 пострілів на хвилину і дальність стрільби до 1000 м.","2100","1","648d5d2a7ef3f.jpg","3");
INSERT INTO Exponat VALUES("27","Куля \"41 Long Colt\"","Ця куля є зразком набою для револьвера, який був створений в 1877 році для револьвера Кольта подвійної дії «Thunderer». Цей набій був подовженою версією попереднього набою .41 Short Colt, який повторював розміри ще ранішого набою .41 Short кільцевого запалення. Куля мала діаметр 0,386 дюйма (9,8 мм) і вагу 200 гран (13 грам)","5","10","648d5fc2af7e3.jpg","3");
INSERT INTO Exponat VALUES("28","Пістолет-Кулемет Шпагіна","Цей пістолет-кулемет є зразком радянської автоматичної зброї, яка була розроблена в 1940 році Георгієм Шпагіним під набій 7,62 × 25 мм ТТ і прийнята на озброєння Червоної Армії в 1941 році. Він був одним з основних пістолетів-кулеметів радянських військ під час Другої світової війни і брав участь у багатьох інших конфліктах ХХ століття. Він мав вагу 3,6 кг (без магазину) і довжину 843 мм. Він стріляв з відкритого затвора з темпом вогню близько 1000 пострілів на хвилину і дальністю стрільби до 200 м","980","1","648d62764d6f1.jpg","3");
INSERT INTO Exponat VALUES("29","фото Сергія Корольова","Це фото зображує Сергія Корольова - видатного українського вченого у галузі ракетобудування та космонавтики, який очолював ракетну програму СРСР. Під його керівництвом було запущено першу міжконтинентальну балістичну ракету, перший штучний супутник Землі, здійснено перший політ людини (Юрія Гагаріна) в космос та вихід людини в космос12. Він народився 12 січня 1907 року в Житомирі, навчався в Києві та Одесі","100","1","648d64e6a35e7.jpg","17");



DROP TABLE User;

CREATE TABLE `User` (
  `id` int NOT NULL AUTO_INCREMENT,
  `Login` varchar(50) NOT NULL,
  `Password` varchar(50) NOT NULL,
  `FirstName` varchar(50) NOT NULL,
  `LastName` varchar(50) NOT NULL,
  `Phone` varchar(20) NOT NULL,
  `Access` int NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

INSERT INTO User VALUES("1","Admin","4297f44b13955235245b2497399d7a93","Admin","Admin","+380991506603","0");
INSERT INTO User VALUES("2","User","e10adc3949ba59abbe56e057f20f883e","Микита","Фартовий","+380991116543","2");
INSERT INTO User VALUES("5","Worker682","96e79218965eb72c92a549dd5a330112","Олександр","Виговський","+380991506602","1");
INSERT INTO User VALUES("9","Worker272","96e79218965eb72c92a549dd5a330112","Микола","Коршун","+380991116543","1");
INSERT INTO User VALUES("10","Worker335","96e79218965eb72c92a549dd5a330112","Григорій","Мельник","+380991506631","1");
INSERT INTO User VALUES("11","Worker196","96e79218965eb72c92a549dd5a330112","Валерій","Патик","+380991506602","1");
INSERT INTO User VALUES("12","User1","96e79218965eb72c92a549dd5a330112","Данііл ","Ліневич","+380991506603","2");



DROP TABLE ViewPlace;

CREATE TABLE `ViewPlace` (
  `id` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) NOT NULL,
  `Description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `id_excursion` int DEFAULT NULL,
  `id_worker` int DEFAULT NULL,
  `Photo` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `id_excursion` (`id_excursion`),
  KEY `id_worker` (`id_worker`),
  CONSTRAINT `viewplace_ibfk_1` FOREIGN KEY (`id_excursion`) REFERENCES `Excursion` (`id`) ON DELETE SET NULL,
  CONSTRAINT `viewplace_ibfk_2` FOREIGN KEY (`id_worker`) REFERENCES `Worker` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB AUTO_INCREMENT=18 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

INSERT INTO ViewPlace VALUES("1","Козацька доба","Виставка присвячена історії та культурі українського козацтва від XV до XVIII століття.Виставка демонструє життя, звичаї, зброю, одяг, символіку та мистецтво козаків, які стали важливою частиною національної ідентичності України","2","9","6488d477c9590.jpg");
INSERT INTO ViewPlace VALUES("2","Перша світова війна","Виставка розповідає про події та наслідки Першої світової війни в Україні, яка тоді була розділена між Російською імперією та Австро-Угорською імперією.","2","8","6488db0c272cb.jpg");
INSERT INTO ViewPlace VALUES("3","Друга світова війнa","Виставка присвячена одному з найтрагічніших періодів в історії українського народу. Україна стала одним з головних театрів воєнних дій на сході Європи, де зустрілися два тоталітарні режими - нацистська Німеччина та радянський Союз","2","9","6488cdeb161bd.jpg");
INSERT INTO ViewPlace VALUES("11","Трипільска культура","Виставка присвячена одній з найбільших і найвидатніших археологічних культур неоліту-енеоліту Європи. Трипільська культура існувала приблизно з 5500 до 2750 року до н.е. на території сучасної України","3","","6488dd93db40e.jpg");
INSERT INTO ViewPlace VALUES("15","Картини видатних митців","Ця виставкова зала присвячена творчості найвидатніших художників України та світу, які залишили свій слід в історії мистецтва. Тут ви можете побачити шедеври живопису різних епох, стилів та напрямків, від класики до сучасності. Виставка демонструє розмаїття художніх форм, технік та ідей, які втілювали митці на полотні","3","10","648c6e67b40cd.jpg");
INSERT INTO ViewPlace VALUES("17","Українські науковці","Ця виставкова зала присвячена видатним українським науковцям, які зробили значний внесок у розвиток науки і техніки в Україні та світі. Тут можна побачити портрети, біографії, документи, книги, макети та інші експонати, пов’язані з життям і діяльністю українських вчених","5","7","648d63f00a286.jpg");



DROP TABLE ViewPlace_exponats;

CREATE TABLE `ViewPlace_exponats` (
  `id_viewplace` int DEFAULT NULL,
  `CountExponats` int NOT NULL DEFAULT '0',
  KEY `viewplace_exponats_ibfk_1` (`id_viewplace`),
  CONSTRAINT `viewplace_exponats_ibfk_1` FOREIGN KEY (`id_viewplace`) REFERENCES `ViewPlace` (`id`) ON DELETE SET NULL ON UPDATE SET NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

INSERT INTO ViewPlace_exponats VALUES("1","7");
INSERT INTO ViewPlace_exponats VALUES("2","4");
INSERT INTO ViewPlace_exponats VALUES("3","13");
INSERT INTO ViewPlace_exponats VALUES("11","11");
INSERT INTO ViewPlace_exponats VALUES("15","4");
INSERT INTO ViewPlace_exponats VALUES("17","1");



DROP TABLE Worker;

CREATE TABLE `Worker` (
  `id` int NOT NULL AUTO_INCREMENT,
  `FirstName` varchar(20) NOT NULL,
  `LastName` varchar(20) NOT NULL,
  `DateOfBirth` varchar(30) NOT NULL,
  `Address` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `Phone` varchar(20) NOT NULL,
  `Login` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

INSERT INTO Worker VALUES("7","Олександр","Виговський","1994-03-06","м.Київ","+380991506602","Worker682");
INSERT INTO Worker VALUES("8","Микола","Коршун","1990-09-29","м.Львів","+380991116543","Worker272");
INSERT INTO Worker VALUES("9","Григорій","Мельник","1995-01-22","м.Житомир","+380991506631","Worker335");
INSERT INTO Worker VALUES("10","Валерій","Патик","1994-03-13","м.Житомир","+380991506602","Worker196");



DROP TABLE Worker_viewplaces;

CREATE TABLE `Worker_viewplaces` (
  `id_worker` int DEFAULT NULL,
  `CountViewplaces` int NOT NULL DEFAULT '0',
  KEY `worker_viewplaces_ibfk_1` (`id_worker`),
  CONSTRAINT `worker_viewplaces_ibfk_1` FOREIGN KEY (`id_worker`) REFERENCES `Worker` (`id`) ON DELETE SET NULL ON UPDATE SET NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

INSERT INTO Worker_viewplaces VALUES("7","1");
INSERT INTO Worker_viewplaces VALUES("8","1");
INSERT INTO Worker_viewplaces VALUES("9","2");
INSERT INTO Worker_viewplaces VALUES("10","1");



