<?php
/**
 * @var string $Content;
 */
?>
<h1><?=$Content?></h1>
<div class="clearfix">
    <img class="rounded col-sm-6 float-md-end mb-3" src="/images/main/Default_exterior_of_the_europe_museum_epic_realistic_high_qual_0.jpg">
    <p>
       <h2 class="fw-bold">Музей історії України</h2>
    </p>
    <p class="fs-4">
        це один з найбільших музеїв в Україні, який присвячений історії українського народу від найдавніших часів до сучасності</p>
    <p class="fs-4">
        Музей був заснований у 1899 році як Київський старожитностний музей і має понад 800 тисяч експонатів, серед яких є унікальні археологічні знахідки, документи, зброя, одяг, монети, витвори мистецтва та інше</p>
    <p class="fs-4">
        Музей проводить наукові дослідження, публікації, освітні програми та виставки. Музей є важливим центром патріотичного виховання та культурної спадщини України</p>
</div>


